RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_pkcau.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(mont_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0010U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(results)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0010U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(mont_para->modulus_n)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0010U), ERR_PARAM_POINTER);
    } else if(0U == mont_para->modulus_n_len) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0010U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the modulus length in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, (mont_para->modulus_n_len << 3));

        /* write the modulus value n to PKCAU RAM */
        pkcau_memcpy_operand(0x00000D5CU, mont_para->modulus_n, mont_para->modulus_n_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_MONT_PARAM);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0x594U, (uint8_t *)results, mont_para->modulus_n_len);
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
}

/*!
    \brief      execute modular operation, include modular addition, modular subtraction and montgomery multiplication
                This function can only be used when interrupt is not enabled (API_ID(0x0011U))
    \param[in]  mod_para: PKCAU modular parameter struct
                  oprd_a: operand A
                  oprd_a_len: operand A length in byte
                  oprd_b: operand B
                  oprd_b_len: operand B length in byte
                  modulus_n: modulus value n
                  modulus_n_len: modulus length in byte
    \param[in]  mode: modular operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_MOD_ADD: modular addition
      \arg        PKCAU_MODE_MOD_SUB: modular subtraction
      \arg        PKCAU_MODE_MONT_MUL: Montgomery multiplication
    \param[out] results: output buffer
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pkcau_mod_operation(pkcau_mod_parameter_struct *mod_para, uint32_t mode, uint8_t *results)
{
    uint32_t timeout;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(mod_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0011U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(results)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0011U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(mod_para->oprd_a) || NOT_VALID_POINTER(mod_para->oprd_b) || NOT_VALID_POINTER(mod_para->modulus_n)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0011U), ERR_PARAM_POINTER);
    } else if((0U == mod_para->oprd_a_len) || (0U == mod_para->oprd_b_len) || (0U == mod_para->modulus_n_len)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the modulus length in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, (mod_para->modulus_n_len << 3));

        /* write the operand A, operand B and modulus value n to PKCAU RAM */
        pkcau_memcpy_operand(0x000008B4U, mod_para->oprd_a, mod_para->oprd_a_len);
        pkcau_memcpy_operand(0x00000A44U, mod_para->oprd_b, mod_para->oprd_b_len);
        pkcau_memcpy_operand(0x00000D5CU, mod_para->modulus_n, mod_para->modulus_n_len);
        /* configure the operation mode */
        pkcau_mode_set(mode & PKCAU_MODE_MOD_MASK);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0xBD0U, (uint8_t *)results, mod_para->modulus_n_len);
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
}

/*!
    \brief      execute modular exponentiation operation
                This function can only be used when interrupt is not enabled (API_ID(0x0012U))
    \param[in]  mod_exp_para: PKCAU exponentiation parameter struct for fast mode
                  oprd_a: operand A
                  oprd_a_len: operand A length in byte
                  exp_e: exponent e
                  e_len: exponent length in byte
                  modulus_n: modulus value n
                  modulus_n_len: modulus length in byte
                  mont_para: exponentiation parameter R2 mod n
                  mont_para_len: montgomery parameter length in byte
    \param[in]  mode: modular exponentiation operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_MOD_EXP_FAST: montgomery parameter computation then modular exponentiation
      \arg        PKCAU_MODE_MOD_EXP: modular exponentiation only
    \param[out] results: output buffer
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pkcau_mod_exp_operation(pkcau_mod_exp_parameter_struct *mod_exp_para, uint32_t mode, uint8_t *results)
{
    uint32_t timeout;

