RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_pkcau.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(point_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0018U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(curve_group_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0018U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(result)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0018U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the length of scalar multiplier k, curve modulus p length in bit and curve coefficient a sign to PKCAU RAM */
        pkcau_memcpy_value(0x00000400U, (curve_group_para->multi_k_len << 3));
        pkcau_memcpy_value(0x00000404U, (curve_group_para->modulus_p_len << 3));
        pkcau_memcpy_value(0x00000408U, curve_group_para->a_sign);

        /* write the curve coefficient a, curve modulus p, scalar multiplier k, point coordinate x and point coordinate y to PKCAU RAM */
        pkcau_memcpy_operand(0x0000040CU, curve_group_para->coff_a, curve_group_para->coff_a_len);
        pkcau_memcpy_operand(0x00000460U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
        pkcau_memcpy_operand(0x00000508U, curve_group_para->multi_k, curve_group_para->multi_k_len);
        pkcau_memcpy_operand(0x0000055CU, point_para->point_x, point_para->point_x_len);
        pkcau_memcpy_operand(0x000005B0U, point_para->point_y, point_para->point_y_len);
        if(mode == PKCAU_MODE_ECC_SCALAR_MUL_FAST) {
            pkcau_memcpy_operand(0x000004B4U, curve_group_para->mont_para, curve_group_para->mont_para_len);
        }
        /* configure the operation mode */
        pkcau_mode_set(mode & PKCAU_MODE_ECC_SCALAR_MUL_MASK);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0x55CU, (uint8_t *)result->point_x, curve_group_para->modulus_p_len);
        pkcau_memread(0x5B0U, (uint8_t *)result->point_y, curve_group_para->modulus_p_len);
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
}

/*!
    \brief      execute ECDSA sign operation
                This function can only be used when interrupt is not enabled (API_ID(0x0019U))
    \param[in]  hash_para: hash struct
                  hash_z: hash value z
                  hash_z_len: hash value z length in byte
    \param[in]  curve_group_para: PKCAU ECC curve parameter struct
                  modulus_p: curve modulus p
                  modulus_p_len: curve modulus p length in byte
                  coff_a: curve coefficient a
                  coff_a_len: curve coefficient a length in byte
                  coff_b: curve coefficient b
                  coff_b_len: curve coefficient b length in byte
                  base_point_x: curve base point coordinate x
                  base_point_x_len: curve base point coordinate x length in byte
                  base_point_y: curve base point coordinate y
                  base_point_y_len: curve base point coordinate y length in byte
                  order_n: curve prime order n
                  order_n_len: curve prime order n length in byte
                  a_sign: curve coefficient a sign
                  multi_k: scalar multiplier k
                  multi_k_len: scalar multiplier k length in byte
                  integer_k: integer k length in byte
                  integer_k_len: integer k length in byte
                  private_key_d: private key d
                  private_key_d_len: private key d length in byte
                  mont_para: montgomery parameter R2 mod n
                  mont_para_len: montgomery parameter R2 mod n length in byte
    \param[out] result: ecdsa signature, ecc scalar multiplication output structure
                  sign_extra: flag of extended ECDSA sign (extra outputs)
                  sign_r: pointer to signature part r
                  sign_s: pointer to signature part s
                  point_x: pointer to point kP coordinate x
                  point_y: pointer to point kP coordinate y
    \retval     flag indicating whether the signature operation was successful
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
uint8_t pkcau_ecdsa_sign_operation(pkcau_hash_parameter_struct *hash_para, \
                                   const pkcau_ec_group_parameter_struct *curve_group_para, \
                                   pkcau_ecc_out_struct *result)
{
    uint8_t res = 2U;
    uint32_t timeout;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(hash_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0019U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(curve_group_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0019U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(result)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0019U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the curve prime order n length, curve modulus p length in bit and curve coefficient a sign to PKCAU RAM */
        pkcau_memcpy_value(0x00000400U, (curve_group_para->order_n_len << 3));
        pkcau_memcpy_value(0x00000404U, (curve_group_para->modulus_p_len << 3));
        pkcau_memcpy_value(0x00000408U, curve_group_para->a_sign);

